# Import Pandas

In [8]:
import pandas as pd

# Create and view a series of three different colours

In [9]:
colors=pd.Series(["red","green","blue"])
colors

0      red
1    green
2     blue
dtype: object

# Create a series of three different car types and view it

In [10]:
car=pd.Series(["suv","convertible","sedan"])
car

0            suv
1    convertible
2          sedan
dtype: object

# Combine the Series of cars and colours into a DataFrame

In [11]:
combine = pd.DataFrame({
    "cat_type":car,
    "color":colors
})
combine

      cat_type  color
0          suv    red
1  convertible  green
2        sedan   blue

# Import "../data/car-sales.csv" and turn it into a DataFrame

In [12]:
car_sales=pd.read_csv("data/car-sales.csv")
car_df=pd.DataFrame(car_sales)
car

0            suv
1    convertible
2          sedan
dtype: object

# Find the different datatypes of the car

In [13]:
car_df.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

# Describe your current car DataFrame using describe()

In [14]:
car_df.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

# Get information about your DataFrame using info()

In [15]:
car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes